ArteryTek/sdk-csp-at32f4/drivers/rtt/f402_405/include/drv_common.h
/*
 * Copyright (c) 2006-2021, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2023-11-16     shelton      first version
 */

#ifndef __DRV_COMMON_H__
#define __DRV_COMMON_H__

#include <rtthread.h>
#include <rthw.h>
#include "board.h"
#include "at32f402_405.h"
#include "at32_msp.h"

#ifdef __cplusplus
extern "C" {
#endif

void _Error_Handler(char *s, int num);

#ifndef Error_Handler
#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#endif

#define DMA_NOT_AVAILABLE ((DMA_INSTANCE_TYPE *)0xFFFFFFFFU)

#define __AT32_PORT(port)  GPIO##port##_BASE
#define GET_PIN(PORTx,PIN) (rt_base_t)((16 * ( ((rt_base_t)__AT32_PORT(PORTx) - (rt_base_t)GPIOA_BASE)/(0x0400UL) )) + PIN)

#define AT32_FLASH_START_ADRESS       ROM_START
#define AT32_FLASH_SIZE               ROM_SIZE
#define AT32_FLASH_END_ADDRESS        ROM_END
/* Note: User can update page size according to chip type */
#define FLASH_PAGE_SIZE               (1 * 1024)

#define AT32_SRAM1_SIZE               RAM_SIZE
#define AT32_SRAM1_START              RAM_START
#define AT32_SRAM1_END                RAM_END

#if defined(__CC_ARM) || defined(__CLANG_ARM)
extern int Image$RW_IRAM1$ZI$Limit;
#define HEAP_BEGIN      ((void *)&Image$RW_IRAM1$ZI$Limit)
#elif __ICCARM__
#pragma section="CSTACK"
#define HEAP_BEGIN      (__segment_end("CSTACK"))
#else
extern int __bss_end;
#define HEAP_BEGIN      ((void *)&__bss_end)
#endif

#define HEAP_END                       AT32_SRAM1_END

#ifdef __cplusplus
}
#endif

#endif

